### import lib

In [34]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from matplotlib import style
style.use("ggplot")
from sklearn.cluster import KMeans
from sklearn.model_selection import train_test_split
from sklearn import preprocessing

### import dataset

In [40]:
df = pd.read_csv("datasets/titanic_data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Drop the unimportant columns

In [41]:
df.drop(['PassengerId', 'Name','Ticket','Cabin'], 1, inplace=True)

### convert non_numeric data into numeric data

In [42]:
#df.convert_objects(convert_numeric=True)
df.fillna(0,inplace=True)

def handel_non_numerical_data(df):
    columns = df.columns.values
    
    for column in columns:
        text_digits_val = {}
        def convert_to_int(key):
            return text_digits_val[key] # return val
        
        
        if df[column].dtype != np.int64 and df[column].dtype != np.float64:
            column_contents = df[column].values.tolist()
            unique_values = set(column_contents)
            value = 0
            for key in unique_values:
                if key not in text_digits_val:
                    text_digits_val[key] = value
                    value += 1
                
            df[column] = list(map(convert_to_int, df[column]))
    return df

In [43]:
df = handel_non_numerical_data(df)
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500         2
1         1       1    1  38.0      1      0  71.2833         1
2         1       3    1  26.0      0      0   7.9250         2
3         1       1    1  35.0      1      0  53.1000         2
4         0       3    0  35.0      0      0   8.0500         2

### train Model, and measure accuracy

In [50]:
X = np.array(df.drop(['Survived'], 1).astype(float))
X = preprocessing.scale(X)
Y = df['Survived']


clf = KMeans(n_clusters = 2)
clf.fit(X)

correct = 0
for i in range(len(X)):
    predict = np.array(X[i]).astype(float)
    predict = predict.reshape(-1, len(predict))
    predict = clf.predict(predict)
    if predict[0] == Y[i]:
        correct += 1
    
print("Accuracy: {}".format(correct/len(X)))

Accuracy: 0.6902356902356902